In [12]:
#imports, column names, load raw UCI file (UCI = University of California, Irvine Machine Learning Repository ---common dataset for training)

import pandas as pd
import numpy as np

# Column names for the raw UCI Adult dataset
cols = [
    "age", "workclass", "fnlwgt", "education", "education_num",
    "marital_status", "occupation", "relationship", "race", "sex",
    "capital_gain", "capital_loss", "hours_per_week", "native_country",
    "income"
]

# Load raw UCI dataset (adult.data in ../data)
df = pd.read_csv("../data/adult.data", names=cols, header=None)

# Strip leading/trailing spaces in string columns (makes data easier for people to read)
for col in df.select_dtypes(include="object"):
    df[col] = df[col].str.strip()

# Quick look at the first few rows of dataset
df.head()

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [13]:
#Basic structure: shape and info (completeness & types)
print("Shape (rows, columns):", df.shape)
print("\n=== dtypes ===")
print(df.dtypes)

print("\n=== DataFrame info ===")
df.info()

Shape (rows, columns): (32561, 15)

=== dtypes ===
age                int64
workclass         object
fnlwgt             int64
education         object
education_num      int64
marital_status    object
occupation        object
relationship      object
race              object
sex               object
capital_gain       int64
capital_loss       int64
hours_per_week     int64
native_country    object
income            object
dtype: object

=== DataFrame info ===
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education_num   32561 non-null  int64
 5   marital_status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital_gain    32561 non-null  int64
 11  capital_loss    32561 non-null  int64
 12  hours_per_week  32561 non-null  int64
 13  native_country  32561 non-null  object
 14  income          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [14]:
# Descriptive stats (numeric + categorical)
# Numeric columns summary
print("=== Numeric columns summary ===")
display(df.describe())

# Categorical columns summary
print("\n=== Categorical columns summary ===")
display(df.describe(include="object"))

=== Numeric columns summary ===

,age,fnlwgt,education_num,capital_gain,capital_loss,hours_per_week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

=== Categorical columns summary ===

,workclass,education,marital_status,occupation,relationship,race,sex,native_country,income
count,32561,32561,32561,32561,32561,32561,32561,32561,32561
unique,9,16,7,15,6,5,2,42,2
top,Private,HS-grad,Married-civ-spouse,Prof-specialty,Husband,White,Male,United-States,<=50K
freq,22696,10501,14976,4140,13193,27816,21790,29170,24720

In [15]:
# Time for some important data cleaning. Here we'll remove leading spaces from entries and replace the UCI missing marker (?) with NaN

# UCI uses '?' (after stripping spaces) to indicate missing categorical values. Replace the (?) with NaN
df_clean = df.replace("?", np.nan)

# Remove leading spaces:

for col in df_clean.select_dtypes(include="object").columns:
    df_clean[col] = df_clean[col].str.strip()


# Double check that we created a new DataFrame
df_clean.head()

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [16]:
# Duplicate rows check (uniqueness)
duplicate_count = df_clean.duplicated().sum()
print("Number of duplicate rows:", duplicate_count)

# Look at some of the duplicates duplicates
if duplicate_count > 0:
    display(df_clean[df_clean.duplicated()].head())

Number of duplicate rows: 24

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
4881,25,Private,308144,Bachelors,13,Never-married,Craft-repair,Not-in-family,White,Male,0,0,40,Mexico,<=50K
5104,90,Private,52386,Some-college,10,Never-married,Other-service,Not-in-family,Asian-Pac-Islander,Male,0,0,35,United-States,<=50K
9171,21,Private,250051,Some-college,10,Never-married,Prof-specialty,Own-child,White,Female,0,0,10,United-States,<=50K
11631,20,Private,107658,Some-college,10,Never-married,Tech-support,Not-in-family,White,Female,0,0,10,United-States,<=50K
13084,25,Private,195994,1st-4th,2,Never-married,Priv-house-serv,Not-in-family,White,Female,0,0,40,Guatemala,<=50K

In [17]:
# Drop the duplicates we found

df_clean = df_clean.drop_duplicates()

# Verify that there are no more duplicates

duplicate_count = df_clean.duplicated().sum()
print("Number of duplicate rows:", duplicate_count)

Number of duplicate rows: 0

In [18]:
# At this point, our data should be properly cleaned. Time for some assessment.

# Missing values per column (counts & percentages)
missing_counts = df_clean.isna().sum()
missing_percent = (missing_counts / len(df_clean)) * 100

missing_summary = (
    pd.DataFrame({
        "missing_count": missing_counts,
        "missing_percent": missing_percent.round(2)
    })
    .sort_values("missing_percent", ascending=False)
)

missing_summary

                missing_count  missing_percent
occupation               1843             5.66
workclass                1836             5.64
native_country            582             1.79
fnlwgt                      0             0.00
education                   0             0.00
education_num               0             0.00
age                         0             0.00
marital_status              0             0.00
relationship                0             0.00
sex                         0             0.00
race                        0             0.00
capital_gain                0             0.00
capital_loss                0             0.00
hours_per_week              0             0.00
income                      0             0.00

In [19]:
# Quick frequency tables for key categorical columns

categorical_cols = [
    "workclass", "occupation", "native_country",
    "race", "sex", "marital_status", "education", "income"
]

for col in categorical_cols:
    print(f"\n=== Value counts for {col} ===")
    display(df_clean[col].value_counts(dropna=False))

=== Value counts for workclass ===

workclass
Private             22673
Self-emp-not-inc     2540
Local-gov            2093
NaN                  1836
State-gov            1298
Self-emp-inc         1116
Federal-gov           960
Without-pay            14
Never-worked            7
Name: count, dtype: int64

=== Value counts for occupation ===

occupation
Prof-specialty       4136
Craft-repair         4094
Exec-managerial      4065
Adm-clerical         3768
Sales                3650
Other-service        3291
Machine-op-inspct    2000
NaN                  1843
Transport-moving     1597
Handlers-cleaners    1369
Farming-fishing       992
Tech-support          927
Protective-serv       649
Priv-house-serv       147
Armed-Forces            9
Name: count, dtype: int64

=== Value counts for native_country ===

native_country
United-States                 29153
Mexico                          639
NaN                             582
Philippines                     198
Germany                         137
Canada                          121
Puerto-Rico                     114
El-Salvador                     106
India                           100
Cuba                             95
England                          90
Jamaica                          81
South                            80
China                            75
Italy                            73
Dominican-Republic               70
Vietnam                          67
Guatemala                        62
Japan                            62
Poland                           60
Columbia                         59
Taiwan                           51
Haiti                            44
Iran                             43
Portugal                         37
Nicaragua                        34
Peru                             31
France                           29
Greece                           29
Ecuador                          28
Ireland                          24
Hong                             20
Trinadad&Tobago                  19
Cambodia                         19
Thailand                         18
Laos                             18
Yugoslavia                       16
Outlying-US(Guam-USVI-etc)       14
Honduras                         13
Hungary                          13
Scotland                         12
Holand-Netherlands                1
Name: count, dtype: int64

=== Value counts for race ===

race
White                 27795
Black                  3122
Asian-Pac-Islander     1038
Amer-Indian-Eskimo      311
Other                   271
Name: count, dtype: int64

=== Value counts for sex ===

sex
Male      21775
Female    10762
Name: count, dtype: int64

=== Value counts for marital_status ===

marital_status
Married-civ-spouse       14970
Never-married            10667
Divorced                  4441
Separated                 1025
Widowed                    993
Married-spouse-absent      418
Married-AF-spouse           23
Name: count, dtype: int64

=== Value counts for education ===

education
HS-grad         10494
Some-college     7282
Bachelors        5353
Masters          1722
Assoc-voc        1382
11th             1175
Assoc-acdm       1067
10th              933
7th-8th           645
Prof-school       576
9th               514
12th              433
Doctorate         413
5th-6th           332
1st-4th           166
Preschool          50
Name: count, dtype: int64

=== Value counts for income ===

income
<=50K    24698
>50K      7839
Name: count, dtype: int64

In [20]:
# Simple cross-tabs for potential bias signals
# Income vs sex
print("=== Income by sex ===")
display(pd.crosstab(df_clean["sex"], df_clean["income"], normalize="index").round(3))

# Income vs race
print("\n=== Income by race ===")
display(pd.crosstab(df_clean["race"], df_clean["income"], normalize="index").round(3))

# Income vs marital_status (often strongly predictive)
print("\n=== Income by marital_status ===")
display(pd.crosstab(df_clean["marital_status"], df_clean["income"], normalize="index").round(3))

=== Income by sex ===

income  <=50K   >50K
sex
Female  0.890  0.110
Male    0.694  0.306

=== Income by race ===

income              <=50K   >50K
race
Amer-Indian-Eskimo  0.884  0.116
Asian-Pac-Islander  0.734  0.266
Black               0.876  0.124
Other               0.908  0.092
White               0.744  0.256

=== Income by marital_status ===

income                 <=50K   >50K
marital_status
Divorced               0.896  0.104
Married-AF-spouse      0.565  0.435
Married-civ-spouse     0.553  0.447
Married-spouse-absent  0.919  0.081
Never-married          0.954  0.046
Separated              0.936  0.064
Widowed                0.914  0.086

In [21]:
# Count unique values
df_clean.nunique()

age                  73
workclass             8
fnlwgt            21648
education            16
education_num        16
marital_status        7
occupation           14
relationship          6
race                  5
sex                   2
capital_gain        119
capital_loss         92
hours_per_week       94
native_country       41
income                2
dtype: int64

In [22]:
# Save the cleaned dataset so far to adult_clean.csv
df_clean.to_csv("../data/adult_clean.csv", index=False)